app/controllers/categories_controller.rb

SELECT `categories`.* FROM `categories` WHERE `categories`.`status` = 'active' AND `categories`.`type_id` IS NULL
INSERT INTO `categories` (`created_at`, `name`, `position`, `status`, `type_id`, `updated_at`) VALUES ('2013-07-22 13:43:15', 'Cabinets-Mirrors', 3, 'active', 1, '2013-07-22 13:43:15')
INSERT INTO `images` (`category_id`, `created_at`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `updated_at`) VALUES (8, '2013-07-22 13:36:40', 'image/jpeg', 'DB309-160.jpg', 46680, '2013-07-22 13:36:39', '2013-07-22 13:36:40')
---
  def create

    image = Image.new(images_params)

    @category = Category.new(categories_params)
    @category.position = Category.where(status: 'active', type_id: params[:type_id]).length+1
    @category.status = "active"

    if @category.save

      image.category_id = @category.id
      image.save

SELECT `categories`.* FROM `categories`
---
  def list

    @categories = Category.all

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 3 LIMIT 1
SELECT `products`.* FROM `products` WHERE `products`.`category_id` = 3
---
  def show

    id = params[:id]
    @category = Category.find(id)
    @products = Product.where(category_id: id)

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
UPDATE `categories` SET `name` = 'Water Jars', `type_id` = 5, `updated_at` = '2013-07-22 18:35:10' WHERE `categories`.`id` = 6
INSERT INTO `images` (`category_id`, `created_at`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `updated_at`) VALUES (1, '2013-07-22 18:32:51', 'image/jpeg', 'DB201-160.jpg', 48953, '2013-07-22 18:32:51', '2013-07-22 18:32:51')
---
  def update

    image = Image.new(images_params)

    @category = Category.find(params[:id])

    if @category.update_attributes(categories_params)

      image.category_id = @category.id
      image.save

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
---
  def delete

    @category = Category.find(params[:id])

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
UPDATE `categories` SET `status` = 'deleted', `updated_at` = '2013-07-20 05:30:25' WHERE `categories`.`id` = 1
---
  def destroy

    @category = Category.find(params[:id])
    @category.status = "deleted"

    if @category.save

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
---
  def recover

    @category = Category.find(params[:id])

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
UPDATE `categories` SET `status` = 'active', `updated_at` = '2013-07-20 05:30:29' WHERE `categories`.`id` = 1
---
  def restore

    @category = Category.find(params[:id])
    @category.status = "active"

    if @category.save