app/controllers/galleries_controller.rb

  def index
    #grabs the types and their associated thumbnials
    @types = Type.where(status: 'active')
---
SELECT `types`.* FROM `types` WHERE `types`.`status` = 'active'

 def show

  @type = Type.find(params[:id])
---
SELECT `types`.* FROM `types` WHERE `types`.`id` = 1 LIMIT 1