app/controllers/images_controller.rb

INSERT INTO `images` (`created_at`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `updated_at`) VALUES ('2013-07-22 04:08:01', 'image/jpeg', 'DB8460-600.jpg', 229511, '2013-07-22 04:08:01', '2013-07-22 04:08:01')
---
  def create

    @image = Image.new(images_params)

    if @image.save