app/controllers/products_controller.rb

  def create
    image = Image.new(images_params)

    puts "IMAGE IS RIGHT HERE: " + image.inspect
   # puts params[:images][:image]

    @product = Product.new(products_params)
    @product.status = "active"
    if @product.save
     image.product_id = @product.id
     image.save
---
INSERT INTO `products` (`created_at`, `description`, `height`, `identifier`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `length`, `name`, `position`, `status`, `updated_at`, `width`) VALUES ('2013-07-22 02:52:00', 'sdf', '3', 'sdf', 'image/jpeg', 'DB8460-600.jpg', 229511, '2013-07-22 02:52:00', '3', 'sdf', 3, 'active', '2013-07-22 02:52:00', '3')
INSERT INTO `images` (`created_at`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `product_id`, `updated_at`) VALUES ('2013-07-22 05:21:09', 'image/jpeg', 'DB8460-600.jpg', 229511, '2013-07-22 05:21:09', 23, '2013-07-22 05:21:09')

  def list

    @products = Product.all
---
SELECT `products`.* FROM `products`

  def update

    @product = Product.find(params[:id])

    if @product.update_attributes(products_params)
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
UPDATE `products` SET `name` = 'Marine Wood Block', `identifier` = 'WB40-11201', `length` = '19', `width` = '10', `height` = '13.5', `description` = '', `updated_at` = '2013-07-22 08:07:07' WHERE `products`.`id` = 23

  def delete

    @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1

  def destroy

    @product = Product.find(params[:id])
    @product.status = "deleted"

    if @product.save
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
UPDATE `products` SET `status` = 'deleted', `updated_at` = '2013-07-20 06:31:35' WHERE `products`.`id` = 2

  def recover

    @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1

  def restore

    @product = Product.find(params[:id])
    @product.status = "active"

    if @product.save
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
UPDATE `products` SET `status` = 'active', `updated_at` = '2013-07-20 06:31:38' WHERE `products`.`id` = 2