app/controllers/types_controller.rb

SELECT `types`.* FROM `types` WHERE `types`.`status` = 'active'
INSERT INTO `types` (`created_at`, `name`, `position`, `status`, `updated_at`) VALUES ('2013-07-22 09:05:56', 'asdf', 8, 'active', '2013-07-22 09:05:56')
INSERT INTO `images` (`created_at`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `type_id`, `updated_at`) VALUES ('2013-07-22 09:35:09', 'image/jpeg', 'DB993-160.jpg', 43161, '2013-07-22 09:35:09', 9, '2013-07-22 09:35:09')
---
  def create

    image = Image.new(images_params)

    @type = Type.new(types_params)
    @type.position = Type.where(status: 'active').length + 1
    @type.status = "active"

    if @type.save

      image.type_id = @type.id
      image.save

SELECT `types`.* FROM `types`
---
  def list

    @types = Type.all

SELECT `types`.* FROM `types` WHERE `types`.`id` = 1 LIMIT 1
SELECT `categories`.* FROM `categories` WHERE `categories`.`type_id` = 1
---
  def show

    id = params[:id]
    @type = Type.find(id)
    @categories = Category.where(type_id: id)

SELECT `types`.* FROM `types` WHERE `types`.`id` = 4 LIMIT 1
---
  def edit

    @type = Type.find(params[:id])

SELECT `types`.* FROM `types` WHERE `types`.`id` = 3 LIMIT 1
UPDATE `types` SET `position` = 3, `name` = 'Petrified Wood', `updated_at` = '2013-07-19 21:17:52' WHERE `types`.`id` = 3
INSERT INTO `images` (`created_at`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `type_id`, `updated_at`) VALUES ('2013-07-22 09:29:01', 'image/jpeg', 'DB200-160.jpg', 39439, '2013-07-22 09:29:01', 1, '2013-07-22 09:29:01')
---
  def update

    image = Image.new(images_params)
    @type = Type.find(params[:id])

    if @type.update_attributes(types_params)

      image.type_id = @type.id
      image.save

SELECT `types`.* FROM `types` WHERE `types`.`id` = 1 LIMIT 1
---
  def delete

    @type = Type.find(params[:id])

SELECT `types`.* FROM `types` WHERE `types`.`id` = 3 LIMIT 1
---
  def undelete

    @type = Type.find(params[:id])

SELECT `types`.* FROM `types` WHERE `types`.`id` = 3 LIMIT 1
UPDATE `types` SET `status` = 'active', `updated_at` = '2013-07-20 01:21:10' WHERE `types`.`id` = 3
---
  def undestroy

    @type = Type.find(params[:id])
    @type.status = "active"

    if @type.save

SELECT `types`.* FROM `types` WHERE `types`.`id` = 3 LIMIT 1
UPDATE `types` SET `status` = 'deleted', `updated_at` = '2013-07-20 01:10:07' WHERE `types`.`id` = 3
---
  def destroy

    @type = Type.find(params[:id])
    @type.status = "deleted"

    if @type.save