app/views/galleries/show.html.erb

<div id="category-grid" style="width:<%= (base*4).to_s %>px;margin:0 auto;">
<% @type.categories.each do |category| %>
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`type_id` = 1