app/views/products/list.html.erb

      <td><%= product.status %></td>
      <td><% product.images.each do |image| %>
---
SELECT `images`.* FROM `images` WHERE `images`.`product_id` = 1